Revit 2024 API
FabricationPart.GetTransform Method
 Gets the transformation matrix of the fabrication part element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public Transform GetTransform()
Visual Basic
Public Function GetTransform As Transform
Visual C++
public:
Transform^ GetTransform()
Return Value
 The transformation matrix of the fabrication part element.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace